//
//
// Dictionary Lists
let dictionaryData = Array(
    // {
    //     cw: "", chinese word
    //     pw: "", pinyin word
    //     kw: "", khmer word

    //     ec: "", example chinese
    //     ep: "", example pinyin
    //     ek: "", example khmer
    // },
    {
        cw: "喝",
        pw: "hē",
        kw: "ផឹក",
        ec: "我喜欢喝啤酒。",
        ep: "Wǒ xǐhuān hē píjiǔ.",
        ek: "ខ្ញុំចូលចិត្តផឹកស្រាបៀរ។",
    },
    {
        cw: "帮忙",
        pw: "bāng máng",
        kw: "​ជួយ",
        ec: "你能帮我一个忙吗？",
        ep: "Nǐ néng bāng wǒ yīgè máng ma?",
        ek: "តើ​អ្នក​អាច​ជួយ​ខ្ញុំ​បាន​ទេ?",
    },
    {
        cw: "会",
        pw: "huì",
        kw: "ចេះ",
        ec: "你会说英语吗？",
        ep: "Nǐ huì shuō yīngyǔ ma?",
        ek: "តើអ្នកអាចនិយាយភាសាអង់គ្លេសបានទេ?",
    },
    {
        cw: "认识",
        pw: "rèn shì",
        kw: "ស្គាល់",
        ec: "很高兴认识你。",
        ep: "Hěn gāoxìng rèn shì nǐ.",
        ek: "រីករាយ​ដែល​បាន​ស្គាល់​អ្នក។",
    },
    {
        cw: "明白",
        pw: "míng bái",
        kw: "យល់",
        ec: "你明白我的意思吗？",
        ep: "Nǐ míngbái wǒ de yìsi ma?",
        ek: "តើ​អ្នក​យល់​ពី​ខ្ញុំ​អត់?",
    },{
        cw: "去",
        pw: "qù",
        kw: "ទៅ",
        ec: "我要去图书馆还这些书。",
        ep: "Wǒ yào qù túshū guǎn hái zhèxiē shū.",
        ek: "ខ្ញុំនឹងទៅបណ្ណាល័យដើម្បីប្រគល់សៀវភៅទាំងនេះ។",
    },
    {
        cw: "来",
        pw: "lái",
        kw: "មក",
        ec: "你肯定你九点能来吗？",
        ep: "Nǐ kěndìng nǐ jiǔ diǎn néng lái ma?",
        ek: "តើអ្នកប្រាកដទេថាអ្នកអាចមកនៅម៉ោងប្រាំបួន?",
    },
    {
        cw: "空",
        pw: "kòng",
        kw: "ទំនេរ",
        ec: "你们有空房间吗？",
        ep: "Nǐmen yǒu kòng fángjiān ma?",
        ek: "តើអ្នកមានបន្ទប់ទំនេរទេ?",
    },
    {
        cw: "说",
        pw: "shuō",
        kw: "និយាយ",
        ec: "你在说什么？",
        ep: "Nǐ zài shuō shénme?",
        ek: "តើ​អ្នក​កំពុង​និយាយ​អ្វី?",
    },
    {
        cw: "听",
        pw: "tīng",
        kw: "ស្តាប់",
        ec: "听到这个消息我感到很遗憾。",
        ep: "Tīng dào zhège xiāoxī wǒ gǎndào hěn yíhàn.",
        ek: "ខ្ញុំ​សោកស្ដាយ​ដែល​បាន​ឮ​ដំណឹង​នេះ។",
    },
    {
        cw: "寻找",
        pw: "xún zhǎo",
        kw: "ស្វែងរក",
        ec: "我在人群中寻找她，但看不到。",
        ep: "Wǒ zài rénqún zhōng xúnzhǎo tā, dàn kàn bù dào.",
        ek: "ខ្ញុំបានស្វែងរកនាងនៅក្នុងហ្វូងមនុស្សប៉ុន្តែមិនឃើញនាងទេ។",
    },
    {
        cw: "见",
        pw: "jiàn",
        kw: "​ជួប",
        ec: "见到你很高兴。",
        ep: "Jiàn dào nǐ hěn gāoxìng.",
        ek: "រីករាយ​ដែល​បាន​ជួប​អ្នក។",
    },
    {
        cw: "亲辛",
        pw: "xīn kǔ",
        kw: "លំបាក",
        ec: "我父亲辛苦地工作为了养家。",
        ep: "Wǒ fùqīn xīnkǔ dì gōngzuò wéi le yǎngjiā.",
        ek: "ឪពុក​របស់​ខ្ញុំ​ខំ​ប្រឹង​ប្រែង​ជួយ​គ្រួសារយ៉ាងលំបាក។",
    },
    {
        cw: "爱",
        pw: "ài",
        kw: "ស្រលាញ់",
        ec: "我爱她就像爱自己的女儿一样。",
        ep: "Wǒ ài tā jiù xiàng ài zìjǐ de nǚ'ér yīyàng.",
        ek: "ខ្ញុំស្រឡាញ់នាងដូចកូនស្រីរបស់ខ្ញុំ។",
    },
    {
        cw: "错",
        pw: "cuò",
        kw: "ខុស",
        ec: "都是我的错。",
        ep: "Dōu shì wǒ de cuò.",
        ek: "វាជាកំហុសរបស់ខ្ញុំទាំងអស់។",
    },
    {
        cw: "吃",
        pw: "chī",
        kw: "ញាំ",
        ec: "我一吃完晚饭就来这里了。",
        ep: "Wǒ yī chī wán wǎnfàn jiù lái zhèlǐle.",
        ek: "ខ្ញុំមកទីនេះភ្លាមៗបន្ទាប់ពីញាំអាហារពេលល្ងាច។",
    },
    {
        cw: "把",
        pw: "bǎ",
        kw: "យក",
        ec: "请您把您的护照给我看一下。",
        ep: "Qǐng nín bǎ nín de hùzhào gěi wǒ kàn yīxià.",
        ek: "សូមបង្ហាញលិខិតឆ្លងដែនរបស់អ្នក។",
    },
    {
        cw: "可以",
        pw: "kě yǐ",
        kw: "អាច",
        ec: "别人能做到的，你也可以。",
        ep: "Biérén néng zuòdào de，nǐ yě kěyǐ.",
        ek: "អ្នកដទៃអាចធ្វើបាន អ្នកក៏អាចធ្វើបានដែរ។",
    },
    {
        cw: "多",
        pw: "duō",
        kw: "ច្រើន",
        ec: "他为班里做了很多好事。",
        ep: "Tā wèi bān lǐ zuòle hěnduō hǎoshì.",
        ek: "គាត់ធ្វើរឿងល្អជាច្រើនសម្រាប់មិត្តរួមថ្នាក់។",
    },
    {
        cw: "学",
        pw: "xué",
        kw: "រៀន",
        ec: "英语好学吗？",
        ep: "Yīngyǔ hàoxué ma?",
        ek: "តើភាសាអង់គ្លេសងាយស្រួលរៀនរឺទេ?",
    },
    {
        cw: "是",
        pw: "shì",
        kw: "គឺ",
        ec: "我们是好朋友。",
        ep: "Wǒmen shì hǎo péngyǒu.",
        ek: "ពួកយើង​គឺ​ជា​មិត្ត​ភក្តិ​ល្អ។",
    },
)
//
//